Ran Plan for 4 projects:

1. dir: `cloudflare` workspace: `default`
1. dir: `gcp/projects/homelab-ng` workspace: `default`
1. dir: `unifi` workspace: `default`
1. dir: `vault` workspace: `default`
---

### 1. dir: `cloudflare` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.tunnel_folly.data.cloudflare_zero_trust_tunnel_cloudflared_token.this: Read complete after 0s
module.tunnel_offsite.data.cloudflare_zero_trust_tunnel_cloudflared_token.this: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # cloudflare_zone_dnssec.pulsifer_ca_dnssec will be updated in-place
! resource "cloudflare_zone_dnssec" "pulsifer_ca_dnssec" {
+       algorithm        = (known after apply)
+       digest           = (known after apply)
+       digest_algorithm = (known after apply)
+       digest_type      = (known after apply)
+       ds               = (known after apply)
+       flags            = (known after apply)
        id               = "7b0fdf753795ec69a1318f64be8d2479"
+       key_tag          = (known after apply)
+       key_type         = (known after apply)
+       modified_on      = (known after apply)
+       public_key       = (known after apply)
-       status           = "disabled" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 3. dir: `unifi` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform init -input=false' in '/atlantis-data/repos/jonpulsifer/infra/361/default/unifi': exit status 1
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Terraform encountered problems during initialisation, including problems
│ with the configuration, described below.
│ 
│ The Terraform configuration must be valid before initialization so that
│ Terraform can determine which modules and providers need to be installed.
│ 
│ 
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 2, in locals:
│    2:   fml_cidr   = "10.1.0.0/24"
│ 
│ A local value named "fml_cidr" was already defined at home.tf:2,3-29. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 3, in locals:
│    3:   fml_domain = "fml.pulsifer.ca"
│ 
│ A local value named "fml_domain" was already defined at home.tf:3,3-33.
│ Local value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 4, in locals:
│    4:   fml_wlan   = "fml"
│ 
│ A local value named "fml_wlan" was already defined at home.tf:4,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 5, in locals:
│    5:   clients    = yamldecode(file("./clients.yaml"))
│ 
│ A local value named "clients" was already defined at home.tf:5,3-50. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 6, in locals:
│    6:   one_day    = 86400
│ 
│ A local value named "one_day" was already defined at home.tf:6,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 7, in locals:
│    7:   one_week   = local.one_day * 7
│ 
│ A local value named "one_week" was already defined at home.tf:7,3-33. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate resource "unifi_network" configuration
│ 
│   on management.tf line 10:
│   10: resource "unifi_network" "fml" {
│ 
│ A unifi_network resource named "fml" was already declared at
│ home.tf:10,1-31. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "unifi_ap_group" configuration
│ 
│   on management.tf line 32:
│   32: data "unifi_ap_group" "all_aps" {
│ 
│ A unifi_ap_group data resource named "all_aps" was already declared at
│ home.tf:32,1-32. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "vault_generic_secret" configuration
│ 
│   on management.tf line 36:
│   36: data "vault_generic_secret" "wifi" {
│ 
│ A vault_generic_secret data resource named "wifi" was already declared at
│ home.tf:36,1-35. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_wlan" configuration
│ 
│   on management.tf line 40:
│   40: resource "unifi_wlan" "fml" {
│ 
│ A unifi_wlan resource named "fml" was already declared at home.tf:40,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 58:
│   58: resource "unifi_user" "personal_devices" {
│ 
│ A unifi_user resource named "personal_devices" was already declared at
│ home.tf:58,1-41. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 73:
│   73: resource "unifi_user" "computers" {
│ 
│ A unifi_user resource named "computers" was already declared at
│ home.tf:73,1-34. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 88:
│   88: resource "unifi_user" "iot" {
│ 
│ A unifi_user resource named "iot" was already declared at home.tf:88,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 103:
│  103: resource "unifi_user" "cameras" {
│ 
│ A unifi_user resource named "cameras" was already declared at
│ home.tf:103,1-32. Resource names must be unique per type in each module.
╵

```
</details>

---
### 4. dir: `vault` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/361/default/vault/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/361/default/vault': exit status 1
data.onepassword_item.google_oauth_client: Reading...
data.onepassword_item.vault: Reading...
data.onepassword_item.vault: Read complete after 1s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/jjojlizpb5p4slytyw2a4llx3m]
data.vault_policy_document.home: Reading...
data.vault_policy_document.ddnsd: Reading...
vault_auth_backend.userpass: Refreshing state... [id=userpass]
vault_mount.pki: Refreshing state... [id=pki]
vault_identity_entity.terraform: Refreshing state... [id=b380bb2c-c5f5-32e3-1de1-6c77ea2a57a1]
vault_identity_entity.jawn: Refreshing state... [id=2f718506-1e1c-1c1d-651a-f2d7c5f431e9]
data.vault_policy_document.godmode: Reading...
vault_auth_backend.gcp: Refreshing state... [id=gcp]
data.vault_policy_document.home: Read complete after 0s [id=1306023824]
vault_auth_backend.approle: Refreshing state... [id=approle]
data.vault_policy_document.ddnsd: Read complete after 0s [id=2650925974]
data.vault_policy_document.godmode: Read complete after 0s [id=4107383416]
vault_mount.home: Refreshing state... [id=home]
vault_policy.home: Refreshing state... [id=home]
vault_policy.ddnsd: Refreshing state... [id=ddnsd]
data.onepassword_item.google_oauth_client: Read complete after 1s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/ynzbgrzrq3enshs37j72g7enhe]
vault_policy.godmode: Refreshing state... [id=godmode]
vault_jwt_auth_backend.google: Refreshing state... [id=google]
vault_jwt_auth_backend_role.google_default: Refreshing state... [id=auth/google/role/google-default]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Get "https://vault.lolwtf.ca/v1/sys/mounts/auth/approle": net/http: TLS handshake timeout
│ 
│   with vault_auth_backend.approle,
│   on auth-approles.tf line 1, in resource "vault_auth_backend" "approle":
│    1: resource "vault_auth_backend" "approle" {
│ 
╵
╷
│ Error: Get "https://vault.lolwtf.ca/v1/sys/mounts/auth/gcp": net/http: TLS handshake timeout
│ 
│   with vault_auth_backend.gcp,
│   on auth-gcp.tf line 1, in resource "vault_auth_backend" "gcp":
│    1: resource "vault_auth_backend" "gcp" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_auth_backend.userpass,
│   on auth-userpass.tf line 1, in resource "vault_auth_backend" "userpass":
│    1: resource "vault_auth_backend" "userpass" {
│ 
╵
╷
│ Error: error checking if IdentityEntity "2f718506-1e1c-1c1d-651a-f2d7c5f431e9" exists: Get "https://vault.lolwtf.ca/v1/identity/entity/id/2f718506-1e1c-1c1d-651a-f2d7c5f431e9": net/http: TLS handshake timeout
│ 
│   with vault_identity_entity.jawn,
│   on entities.tf line 1, in resource "vault_identity_entity" "jawn":
│    1: resource "vault_identity_entity" "jawn" {
│ 
╵
╷
│ Error: error checking if IdentityEntity "b380bb2c-c5f5-32e3-1de1-6c77ea2a57a1" exists: Get "https://vault.lolwtf.ca/v1/identity/entity/id/b380bb2c-c5f5-32e3-1de1-6c77ea2a57a1": net/http: TLS handshake timeout
│ 
│   with vault_identity_entity.terraform,
│   on entities.tf line 10, in resource "vault_identity_entity" "terraform":
│   10: resource "vault_identity_entity" "terraform" {
│ 
╵
╷
│ Error: Get "https://vault.lolwtf.ca/v1/sys/mounts/home": net/http: TLS handshake timeout
│ 
│   with vault_mount.home,
│   on mounts.tf line 1, in resource "vault_mount" "home":
│    1: resource "vault_mount" "home" {
│ 
╵
╷
│ Error: Get "https://vault.lolwtf.ca/v1/sys/mounts/pki": net/http: TLS handshake timeout
│ 
│   with vault_mount.pki,
│   on pki-fml.tf line 1, in resource "vault_mount" "pki":
│    1: resource "vault_mount" "pki" {
│ 
╵
╷
│ Error: error reading from Vault: Get "https://vault.lolwtf.ca/v1/sys/policies/acl/ddnsd": net/http: TLS handshake timeout
│ 
│   with vault_policy.ddnsd,
│   on policy-ddnsd.tf line 9, in resource "vault_policy" "ddnsd":
│    9: resource "vault_policy" "ddnsd" {
│ 
╵
╷
│ Error: error reading from Vault: Get "https://vault.lolwtf.ca/v1/sys/policies/acl/godmode": net/http: TLS handshake timeout
│ 
│   with vault_policy.godmode,
│   on policy-godmode.tf line 9, in resource "vault_policy" "godmode":
│    9: resource "vault_policy" "godmode" {
│ 
╵
╷
│ Error: error reading from Vault: Get "https://vault.lolwtf.ca/v1/sys/policies/acl/home": net/http: TLS handshake timeout
│ 
│   with vault_policy.home,
│   on policy-home.tf line 9, in resource "vault_policy" "home":
│    9: resource "vault_policy" "home" {
│ 
╵


```
</details>

---
### Plan Summary

4 projects, 1 with changes, 1 with no changes, 2 failed